
class NationCurrencyUnitUtil{
  static String getNationCurrency(String nation){
    final Map<String,String> unit = {
      "대한민국": "₩",
      "일본": "¥",
      "중국": "¥",
      "대만": "\$",
      "몽골": "₮",
      "홍콩": "\$",
      "태국": "฿",
      "베트남": "₫",
      "필리핀": "₱",
      "라오스": "₭",
      "캄보디아": "៛",
      "말레이시아": "RM",
      "싱가포르": "\$",
      "미얀마": "K",
      "호주": "\$",
      "인도네시아": "Rp",
      "뉴질랜드": "\$",
      "인도": "₹",
      "영국": "£",
      "프랑스": "€",
      "독일": "€",
      "스페인": "€",
      "포르투칼": "€",
      "이탈리아": "€",
      "그리스": "€",
      "튀르키예": "₤",
      "캐나다": "\$",
      "미국": "\$",
      "맥시코": "\$",
      "콜롬비아": "\$",
      "브라질": "R\$",
      "아르헨티나": "\$",
      "칠레": "\$",
      "️기타": "-"
    };
    return unit[nation]?? "-";
  }
}